#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>


////正整数左移
//int main()
//{
//	int a = 4;
//	//00000000000000000000000000000100 - 整数原反补三码合一
//	int b = a << 1;
//	//00000000000000000000000000000010 - 整数原反补三码合一
//	printf("a = %d,b = %d\n",a,b);
//	return 0;
//}


////负整数左移
//int main()
//{
//	int a = -4;
//	//10000000000000000000000000000100 - 原码
//	//11111111111111111111111111111011 - 反码
//	//11111111111111111111111111111100 - 补码
//	int b = a << 1;
//	//11111111111111111111111111111000 - 补码
//	//11111111111111111111111111110111 - 反码
//	//10000000000000000000000000001000 - 原码
//	printf("a = %d,b = %d\n", a, b);
//	return 0;
//}

//正整数右移
//int main()
//{
//	int a = 4;
//	//00000000000000000000000000000100 - 整数原反补三码合一
//	int b = a >> 1;
//	//00000000000000000000000000000010 - 整数原反补三码合一
//	printf("a = %d,b = %d\n", a, b);
//	return 0;
//}\\//正整数右移

////负整数右移
//int main()
//{
//	int a = -4;
//	//10000000000000000000000000000100 - 原码
//	//11111111111111111111111111111011 - 反码
//	//11111111111111111111111111111100 - 补码
//	int b = a >> 1;
//	//11111111111111111111111111111110 - 补码
//	//11111111111111111111111111111101 - 反码
//	//10000000000000000000000000000010 - 原码
//	printf("a = %d,b = %d\n", a, b);
//	return 0;
//}

////按位（二进制位）与
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 - 补码
//	int b = -5;
//	//10000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//
//	printf("%d\n",a&b);
//	return 0;
//}

////按位（二进制位）或
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 - 补码
//	int b = -5;
//	//10000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//
//	printf("%d\n", a | b);
//	return 0;
//}

//按位（二进制位）异或
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 - 补码
//	int b = -5;
//	//10000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//
//	printf("%d\n", a ^ b);
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	int b = a = a + 1;
//	//相当于是b在初始化的时候，直接把改变过后的a的数值
//	//给到变量b，而在这之前变量a的数值从0已经变为了1
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	a += 1;
//	//相当于是a = a + 1;的简化
//	printf("a = %d\n",a);
//	int b = 2;
//	b *= 3;//相当于是b = b * 3;的简化
//	printf("b = %d\n", b);
//	int c = 10;
//	c >>= 1;//相当于是c = c >> 1;的简化
//	printf("c = %d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 1;
//	int* pa = &a;//取出变量a的地址放入pa这个整形指针变量当中
//	//int*(*说明pa变量是一个指针，而int说明指针的类型是整形)
//	//这里面的int*是个整体，并不是int类型和*（解引用操作符）的复合
//	printf("%p\n",pa);//打印pa的数值，pa是一个整形指针 - %p是打印地址的格式
//	printf("%p\n",&a);//打印变量a的地址，取出变量a的地址并且打印出来
//	printf("%d\n",*(&a));//打印变量a的值，&a是取出a地址
//	//*（解引用操作符）是把找到a的地址并且打印里面的数据内容
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	printf("%d\n",sizeof(a));
//	printf("%zu\n",sizeof(a));
//	//既然sizeof是一个操作符，那么求变量a的大小的时候后方的括号是不是可以不用带？
//	printf("%zu\n",sizeof a);//事实证明，求变量的时候可以不带括号
//	//那么求一个类型呢？
//	printf("%zu\n", sizeof(int));
//	//printf("%zu\n", sizeof int);//会报错，对于类型来说，需要带括号
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = 2;
//	printf("%zu\n",sizeof(a = b + 4));
//	//如果sizeof当中的表达式语句进行计算了，那么变量a的数值应该是6
//	printf("%d\n",a);
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//00000000000000000000000000001010
//	int n = 0;
//	scanf("%d",&n);
//	//把a的二进制位第n位置为1
//	a = a | (1 << (n - 1));
//	printf("a = %d\n",a);
//	//把a的二进制位第n位置为0
//	scanf("%d",&n);
//	a = a & ~(1 << (n - 1));
//	printf("a = %d\n", a);
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//对于逻辑与，是并且的意思，就是操作符的（从左到右）左右两边的操作数都为真，才生效
//	//但凡遇见假的就直接停止，并且后方（右边）的表达式或者操作数直接不关注（不执行）
//	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);
//	printf("i = %d\n",i);
//	//而逻辑操作符无论操作数为多少，只关注真（非0）假（0），执行完毕，返回真假，也就是0或者1
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++||++b||d++;
//	//逻辑或是或者的意思，是操作符左右两边的操作数只要有一个为真，直接生效
//	//当即返回真
//	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);
//	printf("i = %d\n", i);
//	return 0;
//}


//int main()
//{
//	int a = 6;
//	int b = 0;
//	b = (a > 5) ? 3 : -3;
//	//相当于是下方逻辑
//	//if (a > 5)
//	//	b = 3;
//	//else
//	//	b = -3;
//	printf("b = %d\n",b);
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);//逗号表达式
//	printf("c = %d\n",c);
//}

//int main()
//{
//	int a = get_val();
//	count_val(a);
//	while (a = get_val(), count_val(a), a > 0)
//	{
//		//业务处理
//	}
//	//while (a > 0)
//	//{//业务处理
//	//	a = get_val();
//	//	count_val(a);
//	//}
//	return 0;
//}

struct Handsome
{
	char name[20];
	int age;
};

int main()
{
	struct Handsome boy = {"西西",18};
	printf("%s %d\n",boy.name,boy.age);
	//通过 . 来访问结构体中的成员，用法：结构体名 . 成员变量
	struct Handsome* ps = &boy;//结构体指针
	printf("%s %d\n",(*ps).name, (*ps).age);
	//此处通过解引用操作符来将结构体指针转化为结构体，(*ps)当中的括号不能去掉
	printf("%s %d\n",ps->name,ps->age);
	//这里用指针配合->来访问成员，用法：结构体指针 -> 成员变量
	return 0;
}